{
    "speakers":{
        "massimo":{
            "name": "Prof. Massimo Tistarelli",
            "pic": "massimo.png",
            "designation":"Director - Int.l Summer School on Biometrics",
            "address": ["Director","Computer Vision Laboratory","Università di Sassari","Dipartimento di Agraria","Viale Italia 39","07100 Sassari (SS) - Italia"],
            "topic": "Human Face Recognition: What can be Learned from Biological Deep Networks?",
            "date":"03:00 - 3:45 PM (IST), December 04, 2020<br>5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "abstract": ["Due to the imaging variabilities and to the complex nature of the face shape and dynamics, analyzing and recognizing human faces from digital images is still a very complex task.","In the last decade deep learning techniques have strongly influenced many aspects of computational vision. Many difficult vision tasks can now be performed by deploying a properly tailored and trained deep network. Oxford University’s VGG-face is possibly the first deep convolutional network designed to perform face recognition, obtaining unsurpassed performance at the time it was firstly proposed. The enthusiasm for deep learning is unfortunately paired by the present lack of a clear understanding of how they work and why they provide such brilliant performance. The same applies to Face Recognition.","Over the last years, several and more complex deep convolutional networks, trained on very large, mainly private, datasets, have been proposed still elevating the performance bar also on quite challenging public databases, such as the Janus IJB-A and IJB-B. Despite of the progress in the development of such networks, and the advance in the learning algorithms, the insight on these networks is still very limited.","For this reason, we shall analyse the neural architecture of the early stages of the human visual system to devise a biologically-inspired model for face recognition. The aim is not pushing the recognition performance further, but to better understand the representation space produced from a deep network and how it may help explaining the process undergoing a real biological neural architecture.","In this talk we analyse a hybrid model network trying to better understand the role of the different layers, including the retino-cortical mapping simulated by a log-polar image resampling. The following issues will be addressed: <ul><li>What is the representation space within a deep convolutional network and how this reflects the organization of the human visual cortex?</li><li>How the retino-cortical mapping, implemented in the human visual system, may impact the representation space, hence improving the classification performance?</li><li>The relevance of peripheral vs foveal vision for face recognition.</li></ul>"],
            "biography": ["<p><b>Massimo Tistarelli</b> received the Phd in Computer Science and Robotics in 1991 from the University of Genoa. He is Full Professor in Computer Science (with tenure) and director of the Computer Vision Laboratory at the University of Sassari, Italy. Since 1986 he has been involved as project coordinator and task manager in several projects on computer vision and biometrics funded by the European Community.</p>","<p>Since 1994 he has been the director of the Computer Vision Laboratory at the Department of Communication, Computer and Systems Science of the University of Genoa, and now at the University of Sassari, leading several National and European projects on computer vision applications and image-based biometrics.</p>","<p>Prof. Tistarelli is a founding member of the Biosecure Foundation, which includes all major European research centers working in biometrics. His main research interests cover biological and artificial vision (particularly in the area of recognition, three-dimensional reconstruction and dynamic scene analysis), pattern recognition, biometrics, visual sensors, robotic navigation and visuo-motor coordination. He is one of the world-recognized leading researchers in the area of biometrics, especially in the field of face recognition and multimodal fusion. He is coauthor of more than 150 scientific papers in peer reviewed books, conferences and international journals. He is the principal editor for the Springer books <i>Handbook of Remote Biometrics and Handbook of Biometrics for Forensic Science</i>.</p>","<p>Prof. Tistarelli organized and chaired several world-recognized several scientific events and conferences in the area of Computer Vision and Biometrics, and he has been associate editor for several scientific journals including IEEE Transactions on PAMI, IET Biometrics, Image and Vision Computing and Pattern Recognition Letters.</p>","<p>Since 2003 he is the founding director for the Intl. Summer School on Biometrics (now in its 17th edition). He is a Fellow member of the IAPR and Senior member of IEEE, and Vice President of the IEEE Biometrics Council.</p>"]

        },
        "sushmita":{
            "name": "Prof. Sushmita Mitra",
            "pic": "sm.jpg",
            "designation":"INAE Chair Professor and Fulbright-Nehru Senior Researcher",
            "topic":"Intelligent Analysis of Brain Images",
            "address":["Machine Intelligence Unit","Indian Statistical Institute","Kolkata 700108"],
            "date":"12:00 - 12:45 PM (IST), December 05, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "abstract": ["<p>The focus of this talk will be on image analysis, particularly related to brain tumor MRIs (gliomas) – involving intelligent decision-making. It will encompass segmentation, classification, feature selection/extraction, with an objective to provide improved diagnosis, prognosis and treatment planning towards tumor management.</p>","<p>Beginning with an introduction to the nuances of MRI and deep learning, we will introduce a fast localization and detection algorithm involving saliency, followed by a single seed delineation technique for the tumor. Finally we will describe a couple of deep learning based approaches for the detection, classification, segmentation, and survival prediction in glioma patients.</p>"],
            "biography":["Sushmita Mitra is full Professor at the Machine Intelligence Unit (MIU), Indian Statistical Institute, Kolkata. From 1992 to 1994 she was in the RWTH, Aachen, Germany as a DAAD Fellow. She was a Visiting Professor in the Computer Science Departments of the University of Alberta, Edmonton, Canada in 2004, 2007; Meiji University, Japan in 1999, 2004, 2005, 2007; and Aalborg University Esbjerg, Denmark in 2002, 2003. Dr Mitra received the National Talent Search Scholarship from NCERT, India, the University Gold Medal in 1988, the IEEE TNN Outstanding Paper Award in 1994 for her pioneering work in neuro-fuzzy computing, the CIMPA-INRIA-UNESCO Fellowship in 1996, and Fulbright-Nehru Senior Research Fellowship in 2018-2020. She is the author of the books \"Neuro-Fuzzy Pattern Recognition: Methods in Soft Computing\" and \"Data Mining: Multimedia, Soft Computing, and Bioinformatics\" published by John Wiley, and \"Introduction to Machine Learning and Bioinformatics\", Chapman & Hall/CRC Press, beside a host of other edited books. Dr Mitra has guest-edited special issues of several journals, is an Associate Editor of \"IEEE/ACM Trans. on Computational Biology and Bioinformatics\", \"Information Sciences\", \"Fundamenta Informatica\", and is a Founding Associate Editor of \"Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery (WIRE DMKD)\". She has more than 150 research publications in refereed international journals. Dr Mitra is a Fellow of the IEEE, Indian National Science Academy (INSA), International Association for Pattern Recognition (IAPR), and Fellow of the Indian National Academy of Engineering (INAE) and The National Academy of Sciences, India (NASI). She is an IEEE CIS Distinguished Lecturer and the current Chair-Elect, IEEE Kolkata Section. She has visited more than 30 countries as a Plenary/Invited Speaker or an academic visitor, and served as General Chair and/or Program Chair of several international conferences. Her current research interests include data science, deep learning, soft computing, medical image processing, and Bioinformatics."]
        },

        "jiang":{
            "name":"Prof. Xiaoyi Jiang",
            "pic": "jiang.jpg",
            "designation": "Head of Group",
            "topic":"Consensus Learning",
            "address": ["University of Münster","Department of Computer Science","Einsteinstrasse 62","D-48149 Münster"],
            "date": "03:00 - 3:45 PM (IST), December 05, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "abstract": ["Combining multiple models into a consensus model helps, amongst others, to reduce the uncertainty in the initial models. Consensus learning can be formulated informally or formally in arbitrary problem domain. This talk focuses on the formal framework of the so-called generalized median computation. The concept of this framework and the related computation algorithms will be presented. A variety of applications in image analysis and pattern recognition will be shown to demonstrate the power of consensus learning."],
            "biography":["Xiaoyi Jiang studied Computer Science at Peking University, China, and received his PhD and Venia Docendi (Habilitation) degree in Computer Science from University of Bern, Switzerland. He was an associate professor at Technical University of Berlin, Germany. Since 2002 he is a full professor at University of Münster, Germany, and currently the Dean of the Faculty of Mathematics and Computer Science. He is Editor-in-Chief of International Journal of Pattern Recognition and Artificial Intelligence. In addition, he also serves on the advisory board and editorial board of several other journals including IEEE Transactions on Medical Imaging and International Journal of Neural Systems. His research interests include image analysis, pattern recognition, and machine learning. Prof. Jiang is a Fellow of IAPR and senior member of IEEE."]
        },
        "gaurav":{
            "name": "Prof. Gaurav Sharma",
            "pic": "gaurav.jpeg",
            "designation": "Professor",
            "address": ["Department of Electrical and Computer Engineering","Department of Computer Science","University of Rochester","USA"],
            "date": "07:00 - 07:45 PM (IST), December 05, 2020 <br>5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic": "Leveraging Old Tricks in A New World: Efficient Generation of Labeled Data for Deep Learning",
            "abstract": ["In the emerging world of artificial intelligence algorithms and analytics, curated and labeled data is often considered the “new oil.” However, extracting this “oil” is often expensive and fraught with difficulties. Specifically, generation of labeled data can be labor intensive and tedious. Crowd sourcing can distribute the labor and mitigate the cost and tedium for some application scenarios. However, for other applications, such as medicine, the requirement of specialized knowledge and skills can make crowd sourcing unviable and generation of labeled data is therefore both expensive and limited, in volume and accuracy, by the availability of physicians’ time. The problem is even more acute for tasks requiring sample level labeling of large, high-resolution spatio-temporal datasets, for example, for pixel-level labeling of images for medical image segmentation. In this talk, through case studies, we highlight examples where creative use of conventional machine learning, computer vision, and image processing techniques allows us to efficiently generate labeled data for new applications of deep learning. The examples particularly highlight that these conventional tools continue to be effective and useful and will therefore co-existsymbiotically with modern deep learning methodologies."],
            "biography":["Gaurav Sharma is a professor in the Departments of Electrical and Computer Engineering, Computer Science, and Biostatistics and Computational Biology, and a Distinguished Researcher in Center of Excellence in Data Science (CoE) at the Goergen Institute for Data Science at the University of Rochester. He received the PhD degree in Electrical and Computer engineering from North Carolina State University, Raleigh in 1996. From 1993 through 2003, he was with the Xerox Innovation group in Webster, NY, most recently in the position of Principal Scientist and Project Leader. His research interests include data analytics, cyber physical systems, signal and image processing, computer vision, and media security; areas in which he has 54 patents and has authored over 220 journal and conference publications. He currently serves as the Editor-in-Chief for the IEEE Transactions on Image Processing. From 2011 through 2015, he served as the Editor-in-Chief for the Journal of Electronic Imaging and, in the past, has served as an associate editor for the Journal of Electronic Imaging, the IEEE Transactions on Image Processing, and for the IEEE Transactions on Information Forensics and Security. He is a member of the IEEE Publications, Products, and Services Board (PSPB) and chaired the IEEE Conference Publications Committee in 2017-18. He is the editor of the Digital Color Imaging Handbook published by CRC press in 2003. Dr. Sharma is a fellow of the IEEE, a fellow of SPIE, a fellow of the Society for Imaging Science and Technology (IS&amp;T) and has been elected to Sigma Xi, Phi Kappa Phi, and Pi Mu Epsilon. In recognition of his research contributions, he received an IEEE Region I technical innovation award in 2008. Dr. Sharma is a 2020-2021 Distinguished Lecturer for the IEEE Signal Processing Society."]

        },
        "ramakrishnan":{
            "name": "Prof. Ramakrishnan Ganesan Angarai",
            "pic": "rama.png",
            "designation": "Professor",
            "address": ["Medical Intelligence & Language Engineering Laboratory", "Department of Electrical Engineering", "Indian Institute of Science, Bangalore"],
            "date":"10:45 - 11:30 AM (IST), December 04, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic": "Hard-coded features in the brain and its relevance for deep learning",
            "abstract":["<p>Human vision is the most sophisticated pattern recognition system known to us. Human sensory pathways use very rich, active feedback during the recognition process. For example, at the LGN, 31% of the synapses are due to feedback from the corticothalamic circuits, whereas only 7% are due to the inputs from the retinal ganglion (feedforward circuits). Similarly, in the auditory pathway, there is active feedback to the outer hair cells in the basilar membrane, which in turn modulate the responses of the inner hair cells to the auditory stimuli. Also, attention plays a very important role in visual processing and perception by modulating the sensitivity and selectivity. Feedback connections are important in the differentiation of figure from ground, particularly in the case of stimuli of low visibility. Studies on primates have shown that both spatial and feature based attention influence the neuronal representation of visual stimuli. Thus, there is a clear case for attention to finer details, based on feedback from higher level processes. Most machine learning systems use feedback to tune the system parameters during training. However, feedback is seldom used during testing. Ramakrishnan proposed in 2010 the attention-feedback mechanism in machine learning systems for increasing their performance.</p>","<p>There is a current push in research to design deep neural networks (DNN's) as end to end systems, where every kind of processing is accomplished by the network, including the feature extraction, by learning from the data. However, the DNNs have been designed to simulate the biological neural network in the brain and there are many hard-coded feature extractors in the human brain, and even animal sensory systems. One might argue that it is possible for the visual cortex to extract the gray image from the colour image obtained by the cones in the retina. However, nature has chosen to have many more rods than cones to directly obtain the gray images also in parallel. Further, the work of Hubel and Wiezel showed the existence of orientation selective cells in the lateral geniculate nucleus and visual cortex of kitten. Also, different regions of the basilar membrane in the cochlea respond to different frequencies in both man and animals and this processing is akin to sub-band decomposition of the input audio signal. Thus, hard-coded feature extraction in the brain enhances the classification potential of the biological neural network.</p>"],
            "biography":["<p>Ramakrishnan’s research focuses on real-life applications of signal processing and machine learning. As the leader of a research consortium, he was instrumental in creating handwriting recognition technologies for eight Indian languages. He received Manthan award twice for creating audio books for blind students through his OCR and TTS in Tamil and Kannada. He is also studying the neural control and physiological mechanisms behind the health and therapeutic effects of deep breathing.</p>","<p>For his doctoral work on evoked potentials from leprosy patients, he had received Sir Watt Kay Young Researcher’s Prize from the Royal College of Physicians and Surgeons, Glasgow.</p>","<p><strong>Research Areas:</strong><ul><li>Speech recognition</li> <li>speech synthesis</li> <li>brain-computer interface</li> <li>neural signal processing</li></ul></p>"]
        },
        "guru":{
            "name": "Prof. DS Guru",
            "pic": "dsg.jpg",
            "designation":"Senior Research Scientist on Sabbatical, Nymo Tech, Bangalore<br>Professor",
            "address":["Department of Studies in Computer Science","University of Mysore","Mysore - 570006, India"],
            "date":"12:45 - 01:30 PM (IST), December 05, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic":"AI in Reality: Challenges and Opportunities",
            "abstract":["<p>It has become a common practice to use artificial intelligent (AI) enabled solutions in most of our day to day activities encompassing many domains including medical sciences, education, sports, etc. The existence of machine learning algorithms in general, appearance of deep learning algorithms in specific impacted a lot on possibility of making the world a safer place to live using next generation AI powered products. However, deployment of AI based solutions in a real environment working on live data needs tremendous amount efforts to be put in by research community. This talk is towards highlighting challenges and opportunities for the AI scientists towards bringing AI products in reality. Various computer vision based use cases will be presented along with solutions that suit real environment. The science of both machine learning and deep learning will be presented initially and subsequently different challenges along with opportunities for the data scientists shall be detailed through some interesting examples.</p>"],
            "biography":["<p>Dr. D S Guru is currently a Professor of Computer Science at University of Mysore. He graduated from University of Mysore holding Rank positions both at Bachelor’s and Master’s levels. After obtaining Ph.D from University of Mysore, he was at PRIP Lab, Michigan State University for his postdoctoral work. He was with Nymo Pvt Ltd as senior research scientist working towards productization of computer vision solutions. He is a recipient of BOYSCAST fellowship from DST, Gout of India, ARP award from VGST, Gout of Karnataka, India, and he is identified as a best ethical teacher at higher education by Rotary North Mysore. He chaired sessions and delivered lectures at many international conferences and workshops in India and also outside India including USA, China, Russia. He is a life member of several academic cum professional bodies. He serves as an associate editor for journal of Pattern Recognition and as a reviewer for many international journals. He edited 5 books and authored 3 text books. He has published 80+ research papers in reputed journals and more than 300 papers in proceedings of reputed conferences. His areas of research interest include image processing, pattern recognition, symbolic data analysis and data indexing. He is also an educationist being a founder trustee of Maharaja Education Trust in Mysore which established schools, colleges including colleges for engineering education.</p>"]
        },
        "kamiya":{
            "name":"Ms. Kamiya Khatter",
            "pic":"kamiya.jpg",
            "designation":"Associate Editor, Applied Sciences and Engineering",
            "address":["Springer Nature India, New Delhi"],
            "date":"03:45 - 05:15PM (IST), December 06, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic":"Ethical Academic and Scientific Publishing",
            "abstract":["<p>Some of the key topics that will be covered during the presentation are:<ol><li>Research Integrity</li><li>Peer Review</li><li>Authorship</li><li>Data fabrication/falsification</li><li>Image manipulation</li><li>Duplicate submission/publication and redundant publication</li><li>Plagiarism</li><li>Manipulation of the publication process</li><li>Conflict of interest</li><li>Ethical approval</li></ol></p>"],
            "biography":["<p><strong>Kamiya Khatter</strong> is presently working as Associate Editor at Springer Nature. She is a part of the Global Acquisition Team at Springer, an imprint of Springer Nature. She is responsible for acquisition and publishing of books in Engineering and Applied Sciences portfolio. She has worked in various areas of academic publishing  for both books and journals in the past.</p>"]
        },
        "umapada":{
            "name":"Prof. Umapada Pal",
            "pic": "umapada.jpeg",
            "designation": "Head, Computer Vision and Pattern Recognition Unit",
            "address": ["Indian Statistical Institute", "Kolkata-108, India"],
            "date":"03:00 - 03:45 PM (IST), December 06, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic": "Air Writing Recognition without Depth Sensor",
            "abstract":["<p>This talk will deal Air Writing Recognition. Air-writing refers to virtually writing linguistic characters through hand gestures in three-dimensional space. With rapid development of depth sensors in recent years such as Kinect and LEAP Motion, the possibility of air-writing systems has been emerged. Depth sensors along with computer vision techniques are used to track finger tips followed by recognition of the performed gestures using a trained model. But these sensors are not widely available to common devices (like mobile, laptops etc) which restrict these systems to be easily accessible. While depth sensors are not widely available, generic camera is embedded in many commonly used devices. Therefore a generic video camera based air-writing system could be greatly beneficial. In this talk, I shall discuss about video camera based air writing recognition and it its different applications in real life. If time permits I shall briefly talk about other recent handwriting applications also. Finally, for better understanding of the techniques some demonstrations will be given to the audience. </p>"],
            "biography":["<p><strong>Umapada Pal</strong> received his Ph.D. in 1997 from Indian Statistical Institute. His PhD work was on the development of printed Bangla OCR system. He did his Post Doctoral research at INRIA (Institut National de Recherche en Informatique et en Automatique), France. From January 1997, he is a Faculty member of Computer Vision and Pattern Recognition Unit (CVPRU) of the Indian Statistical Institute, Kolkata and at present he is Professor and Head of CVPRU. His fields of research interest  is different pattern recognition problems like Digital Document Processing, Optical Character Recognition, Camera/video text processing,  Biometrics, Document Retrieval, keyword spotting, video avalysis etc. He has published more than 415 research papers in various international journals, conference proceedings and edited volumes. Because of his significant impact in the Document Analysis research, in 2003 he received “ICDAR Outstanding Young Researcher Award” from International Association for Pattern Recognition (IAPR). In 2005-2006 Dr. Pal has received JSPS fellowship from Japan government. In 2008, 2011 and 2012, Dr. Pal received visiting fellowship from Spain, France and Australia government, respectively. Dr. Pal has been serving as General/Program/Organizing Chair of many conferences including International Conference on Document Analysis and Recognition (ICDAR), International Conference on Frontiers of Handwritten Recognition (ICFHR), International Workshop on Document Analysis and Systems (DAS), Asian Conference on Pattern recognition (ACPR) etc. Also he has served as a program committee member of more than 60 international events. He has many international research collaborations and supervising Ph.D. students of 5 foreign universities. He is the Co-Editor-In-Chief of Springer Nature Computer Science journal. He is serving as associate Editor of the Pattern Recognition journal, ACM Transactions of Asian Language Information Processing (ACM-TALIP), Pattern recognition Letters (PRL), International Journal of Document Analysis and Recognition, and IET Biometrics.  Also he has served as a guest editor of several special issues. He is a Fellow of International Association for Pattern Recognition. Also, he is among the top two percent scientists in the world as listed by the Stanford University in 2020.</p>"]


        },
        "bchanda":{
            "name":"Prof. Bhabatosh Chanda",
            "pic": "bchanda.jpg",
            "designation": "Professor",
            "address":["Electronics and Communication Sciences Unit", "Indian Statistical Institute, Kolkata"],
            "date":"10:45 - 11:30 AM (IST), December 06, 2020, 5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic":"Image Dehazing",
            "abstract":["<p>An important task in computer vision methodologies is to improve the quality of the image for subsequent analysis. The degradation problem that has drawn attention of researchers recently is degradation when image is captured in the fog or haze environment. The methods developed so far for image dehazing can clearly be categorized into two groups: model driven and data driven. In this presentation, starting from problem definition, we give overview of both the categories. And then describe on method from each category in detail.</p>"],
            "biography":["<p>Received B.E. in Electronics and Telecommunication Engineering and PhD in Electrical Engineering from University of Calcutta in 1979 and 1988 respectively. His research interest includes Image and video Processing, Pattern Recognition, Computer Vision and Mathematical Morphology. He has published more than 200 technical articles in refereed journals and conferences, authored two books and edited five books. He has received `Young Scientist Medal' of Indian National Science Academy in 1989, `Computer Engineering Division Medal' of the Institution of Engineers (India) in 1998, 'Vikram Sarabhai Research Award in 2002 and IETE-Ram Lal Wadhwa Gold medal in 2007. He is fellow of Institute of Electronics and Telecommunication Engineers (FIETE), National Academy of Science, India (FNASc.), Indian National Academy of Engineering (FNAE), and International Association of Pattern Recognition (FIAPR).</p><p>He is a Professor in Indian Statistical Institute, Kolkata, India.</p>"]

        },
        "kiran" : {
            "name": "Dr. Kiran Raja",
            "pic": "kiran.png",
            "designation": "Associate Professor",
            "address": ["Department of Computer Technology and Informatics","Faculty of Information Technology and Electrical Engineering","NTNU Norway"],
            "date":"05:30 - 6:30 PM (IST), December 04, 2020<br>5th IAPR International Conference on Computer Vision &amp; Image Processing",
            "topic": "Deep Learning for Morphing Attacks - Generation and Detection in Biometrics",
            "biography": ["<p><strong>Kiran Raja</strong> obtained his PhD in computer Science from Norwegian University of Science and Technology (NTNU), Norway in 2016. He is faculty member at Dept. of Computer Science at NTNU, Norway. His main research interests include statistical pattern recognition, image processing, and machine learning with applications to biometrics, security and privacy protection. He was/is participating in EU projects SOTAMD, iMARS and other national projects. He has authored several papers in his field of interest and serves as a reviewer for number of journals and conferences. He is a member of EAB and chairs Academic Special Interest Group at EAB. He also works as a consultant for various national agencies within Norway.</p>"],
            "abstract":["<p>Morphing attacks have emerged as recent but efficient threats on face recognition systems. Given face recognition systems are widely used in civilian identity management (such as passport issuance, visa management), many operations will be impacted if morphing attacks are not detected and prevented. Based on the findings from EU-FP7-FIDELITY project, EU has started coordinating efforts to make the face recognition systems robust against morphing attacks. The talk will focus on deep learning approaches for morphing attacks from both spectrum – generation and detection.</p>"]
        }
    }
}

